//  Copyright 2009 Google Inc.
//  Licensed under the Apache License, Version 2.0 (the License); you may not
//  use this file except in compliance with the License.  You may obtain a copy
//  of the License at
// 
//  http://www.apache.org/licenses/LICENSE-2.0
// 
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an AS IS BASIS, WITHOUT
//  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
//  License for the specific language governing permissions and limitations under
//  the License.
//

HTMLExportTemplate = "<!DOCTYPE html PUBLIC '-//W3C//DTD XHTML 1.0 Strict//EN'
   'http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd'>
  <html xmlns='http://www.w3.org/1999/xhtml'>
    <head>
      <meta http-equiv='content-type' content='text/html; charset=utf-8' />
      <meta name='generator' content='CoverStory' />
      <link rel=StyleSheet href='coverstory.css' type='text/css'>
      <script src='coverstory.js' language='javascript' type='text/javascript'></script>
      <title>__TITLE__</title>
    </head>
    <body id='coverstory' onload='coverstory_load()' onunload='coverstory_unload()'>
      <div id='maincontainer'>
        <h1 id='sourcename'>__SOURCE_NAME__</h1>
        <h2 id='sourcepath'>__SOURCE_PATH__</h2>
        <div id='sourcedate'>__SOURCE_DATE__</div>
        <div id='filelistcontainer'>
          <div id='filesummary'>__FILE_SUMMARY__</div>
          <table id='filetable'>
            <tr id='filelistheader'>
              <th id='filelistheadersource'>Source</th>
              <th id='filelistheaderpercent'>%</th>
            </tr>
            __FILE_DATA__
          </table>
        </div>
        <div id='sourcecontainer'>
          <div id='sourcesummary'>__SOURCE_SUMMARY__</div>
          <table id='sourcetable'>
          __SOURCE_DATA__
          </table>
        </div>
      </div>
    </body>
  </html>";

HTMLIndexTemplate = "<!DOCTYPE html PUBLIC '-//W3C//DTD XHTML 1.0 Strict//EN'
   'http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd'>
  <html xmlns='http://www.w3.org/1999/xhtml'>
    <head>
      <meta name='generator' content='CoverStory' />
      <meta http-equiv='content-type' content='text/html; charset=utf-8' />
      <meta http-equiv='REFRESH' content='0;url=__REDIRECT_URL__'>
    </head>
    <body>
    </body>
  </html>
";